Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Only the lines where Vim recognized a file name and line number are listed here. It assumes those are the interesting lines and the rest is just boring messages. However, sometimes unrecognized lines do contain something you want to see. Output from the linker, for example, about an undefined function. To see all the messages add a "!" to the command: >
es_es: Sólo se muestran las líneas donde Vim reconoció un nombre de archivo y un número de línea. Asume que aquéllas son las líneas de interés, mientras que toma el resto como mensajes aburridos. Aún así, a veces las líneas no reconocidas contiene algo que desea ver. Por ejemplo, la salida del enlazador acerca de una función no definida. Para ver todos los mensajes, añada «!» a la orden: >

source: Vim will highlight the current error. To go back to the previous error, use: > :cprevious
es_es: Vim resaltará el error actual. Use lo siguiente para volver al error anterior: > :cprevious

source: :cfirst to first error :clast to last error :cc 3 to error nr 3
es_es: :cfirst primer error :clast último error :cc 3 error número 3

source: The name of the program to run when the ":make" command is executed is defined by the 'makeprg' option. Usually this is set to "make", but Visual C++ users should set this to "nmake" by executing the following command: >
es_es: El nombre del programa a ejecutar cuando usa la orden «:make» se define con la opción 'makeprg'. Habitualmente, esto se define como «make», pero usuarios de Visual C++ deberían definir esto como «nmake» ejecutando la siguiente orden: >

source: You can also include arguments in this option. Special characters need to be escaped with a backslash. Example: >
es_es: También puede incluir argumentos en esta opción. Los caracteres especiales se deben escapar con una barra inversa. Ejemplo: >

source: You can include special Vim keywords in the command specification. The % character expands to the name of the current file. So if you execute the command: > :set makeprg=make\ %
es_es: Puede incluir palabras clave especiales de Vim al especificar la orden. El carácter «%» se expande con el nombre del archivo actual. Así que se ejecuta la siguiente orden: > :set makeprg=make\ %

source: Suppose you ":make" a program. There is a warning message in one file and an error message in another. You fix the error and use ":make" again to check if it was really fixed. Now you want to look at the warning message. It doesn't show up in the last error list, since the file with the warning wasn't compiled again. You can go back to the previous error list with: >
es_es: Suponga que compila un programa con «:make». Hay un mensaje de aviso en un archivo y un mensaje de error en otro. Arregla el mensaje y usa «:make» otra vez para comprobar que lo ha arreglado. Ahora desea ver el mensaje de aviso. No aparece en la última lista de errores ya que aún no se ha compilado el archivo con el aviso. Puede volver a la lista de errores previa con: >

source: Then use ":clist" and ":cc {nr}" to jump to the place with the warning. To go forward to the next error list: >
es_es: Use ahora «:clist» y «:cc {nr}» para saltar al lugar con el aviso. Use lo siguiente para avanzar a la siguiente lista de errores: >

source: You have to tell Vim what format the error messages are that your compiler produces. This is done with the 'errorformat' option. The syntax of this option is quite complicated and it can be made to fit almost any compiler. You can find the explanation here: |errorformat|.
es_es: Tiene que indicar a Vim el formato de los mensajes de error que produce su compilador. Se puede hacer con la opción 'errorformat'. La sintaxis de esta opción es algo complicada, y puede hacer que encaje con prácticamente cualquier compilador. Puede encontrar la explicación aquí: |errorformat|.

source: You might be using various different compilers. Setting the 'makeprg' option, and especially the 'errorformat' each time is not easy. Vim offers a simple method for this. For example, to switch to using the Microsoft Visual C++ compiler: >
es_es: Puede que esté usando varios compiladores diferentes. Definir la opción 'makeprg' y especialmente la opción 'errorformat' cada vez no es un tarea sencilla. Vim ofrece una forma sencilla de hacer esto. Por ejemplo, para cambiar al compilador Microsoft Visual C++: >

source: This will find the Vim script for the "msvc" compiler and set the appropriate options. You can write your own compiler files. See |write-compiler-plugin|.
es_es: Esta orden encontrará el script de Vim para el compilador «msvc» y definirá las opciones adecuadas. Puede escribir sus propios archivos de compilador. Consulte |write-compiler-plugin|.

source: The ":make" command redirects the output of the executed program to an error file. How this works depends on various things, such as the 'shell'. If your ":make" command doesn't capture the output, check the 'makeef' and 'shellpipe' options. The 'shellquote' and 'shellxquote' options might also matter.
es_es: La orden «:make» redirige la salida del programa ejecutado a un archivo error. El modo en que esto último funciona depende de varias cosas, tales como la consola ('shell'). Si su orden «:make» no captura la salida, compruebe las opciones 'makeef' y 'shellpipe'. Las opciones 'shellquote' y 'shellxquote' también son de importancia.

source: In case you can't get ":make" to redirect the file for you, an alternative is to compile the program in another window and redirect the output into a file. Then have Vim read this file with: >
es_es: En el caso de que no pueda hacer que «:make» redirija la salida del archivo, una alternativa es compilar el programa en otra ventana y redirigir la salida al archivo. Después, haga que Vim lea este archivo con: >

source: *30.2* Indenting C style text
es_es: *30.2* Sangrado en archivos C

source: A program is much easier to understand when the lines have been properly indented. Vim offers various ways to make this less work. For C or C style programs like Java or C++, set the 'cindent' option. Vim knows a lot about C programs and will try very hard to automatically set the indent for you. Set the 'shiftwidth' option to the amount of spaces you want for a deeper level. Four spaces will work fine. One ":set" command will do it: >
es_es: Un programa es mucho más fácil de entender cuando las líneas tienen un sangrado adecuado. Vim ofrece varias formas de facilitar esto. Para programas C o con estilo C como Java o C++, defina la opción 'cindent'. Vim sabe mucho acerca de programas C e intentará definir el sangrado automáticamente. Defina la opción 'shiftwidth' con el número de espacios que desea para cada nivel de profundidad. Cuatro espacios funcionarán bien. Puede hacerlo con una orden 'set': >

source: if (flag) Automatic indent ---> do_the_work(); Automatic unindent <-- if (other_flag) { Automatic indent ---> do_file(); keep indent do_some_more(); Automatic unindent <-- }
es_es: if (opción) Sangrado automático ---> do_the_work(); Eliminar sangrado automático <-- if (otra_opción) { Sangrado automático ---> do_file(); Preservar el sangrado do_some_more(); Eliminar sangrado automático <-- }

source: When you type something in curly braces ({}), the text will be indented at the start and unindented at the end. The unindenting will happen after typing the '}', since Vim can't guess what you are going to type.
es_es: Cuando teclee algo entre llaves ({}), el texto tendrá un sangrado al inicio, pero no al final. La eliminación de sangrado («unindenting») aparecerá después de teclear '}', ya que Vim no puede adivinar qué va a escribir.

source: One side effect of automatic indentation is that it helps you catch errors in your code early. When you type a } to finish a function, only to find that the automatic indentation gives it more indent than what you expected, there is probably a } missing. Use the "%" command to find out which { matches the } you typed. A missing ) and ; also cause extra indent. Thus if you get more white space than you would expect, check the preceding lines.
es_es: Un efecto secundario del sangrado automático es que le permite encontrar los errores en su código de manera temprana. Si teclea «}» para finalizar una función y ve que el sangrado automático la da más del esperado, puede que falte un «}». Use la orden «%» para encontrar qué «{» encaja con la «}» que introdujo. Un «)» y «;» omitido también causan un sangrado adicional. Por ello, si obtiene más espacios en blanco del esperado, compruebe la líneas precedentes.

source: When you have code that is badly formatted, or you inserted and deleted lines, you need to re-indent the lines. The "=" operator does this. The simplest form is: >
es_es: Cuando tiene código mal formateado, o si ha insertado o eliminado líneas, tendrá que sangrar las líneas nuevamente. El operador «=» hace esto. La forma más simple es: >

source: I you have really badly indented code, you can re-indent the whole file with: > gg=G
es_es: Si tiene código con un pésimo sangrado, puede sangrar nuevamente el archivo completo con: > gg=G

source: However, don't do this in files that have been carefully indented manually. The automatic indenting does a good job, but in some situations you might want to overrule it.
es_es: Sin embargo, no lo haga en los archivos que han sido cuidadosamente sangrados manualmente. El sangrado automático hace un buen trabajo, pero en algunas situaciones puede que desee anularlo.

source: Different people have different styles of indentation. By default Vim does a pretty good job of indenting in a way that 90% of programmers do. There are different styles, however; so if you want to, you can customize the indentation style with the 'cinoptions' option. By default 'cinoptions' is empty and Vim uses the default style. You can add various items where you want something different. For example, to make curly braces be placed like this:
es_es: Diferentes personas tienen diferentes estilos de sangrado. Por omisión, Vim realiza un buen trabajo de sangrado de la manera en que lo hace el 90% de los programadores. Aun así, hay diferentes estilos; así que si lo desea, puede personalizar el estilo de sangrado con la opción 'cinoptions'. Por omisión, 'cinoptions' está vacío, usando Vim el estilo predeterminado. Puede añadir varios elementos cuando desee algo diferente. Por ejemplo, para ubicar llaves de la siguiente forma:

source: if (flag) ~ { ~ i = 8; ~ j = 0; ~ } ~
es_es: if (opción) ~ { ~ i = 8; ~ j = 0; ~ } ~

source: Use this command: >
es_es: Use esta orden: >

source: There are many of these items. See |cinoptions-values|.
es_es: Hay muchos de estos elementos. Consulte |cinoptions-values|.

source: *30.3* Automatic indenting
es_es: *30.3* Sangrado automático

source: You don't want to switch on the 'cindent' option manually every time you edit a C file. This is how you make it work automatically: >
es_es: No desea activar la opción 'cindent' manualmente cada vez que edite un archivo C. Esta es la forma de hacer que funcione automáticamente: >

source: Actually, this does a lot more than switching on 'cindent' for C files. First of all, it enables detecting the type of a file. That's the same as what is used for syntax highlighting. When the filetype is known, Vim will search for an indent file for this type of file. The Vim distribution includes a number of these for various programming languages. This indent file will then prepare for automatic indenting specifically for this file.
es_es: En realidad, esto hace mucho más que activar 'cindent' para archivos C. En primer lugar, activa la detección de tipo de archivo. Es igual a lo usado para el resaltado de sintaxis. Si el tipo de archivo es conocido, Vim buscará un archivo de sangrado para este tipo de archivo. La distribución de Vim incluye un número para estos lenguajes de programación. Este archivo de sangrado preparará automáticamente el sangrado específico para este archivo.

source: If you don't like the indenting for one specific type of file, this is how you avoid it. Create a file with just this one line: >
es_es: Si no le gusta el sangrado para un tipo específico de archivo, esta es la forma de evitarlo. Cree un archivo con sólo esta línea: >

source: {directory}/indent/{filetype}.vim
es_es: {directorio}/indent/{tipo-de-archivo}.vim

source: The {filetype} is the name of the file type, such as "cpp" or "java". You can see the exact name that Vim detected with this command: >
es_es: El {tipo-de-archivo} es el nombre del tipo de archivo, por ejemplo, «cpp» o «java». Puede ver el nombre exacto de archivo que Vim ha detectado con la siguiente orden: >

source: Thus you would use "help" for {filetype}. For the {directory} part you need to use your runtime directory. Look at the output of this command: >
es_es: Entonces, usaría «help» para {tipo-de-archivo}. Para la parte de {directorio}, necesita usar su directorio de tiempo de ejecución. Mire la salida de esta orden: >

source: Now use the first item, the name before the first comma. Thus if the output looks like this:
es_es: Ahora use el primer elemento, el nombre que precede a la primera coma. Así, la salida tiene el siguiente aspecto:

source: You use "~/.vim" for {directory}. Then the resulting file name is:
es_es: Puede usar «~/.vim» para el {directorio}. Entonces, el nombre del archivo resultante es:

source: Instead of switching the indenting off, you could write your own indent file. How to do that is explained here: |indent-expression|.
es_es: En lugar de desactivar el sangrado, podría escribir su propio archivo de sangrado. La manera de hacerlo se explica aquí: |indent-expression|.

source: *30.4* Other indenting
es_es: *30.4* Otros sangrados

source: When you are using 'autoindent' or 'smartindent' to get the indent of the previous line, there will be many times when you need to add or remove one 'shiftwidth' worth of indent. A quick way to do this is using the CTRL-D and CTRL-T commands in Insert mode. For example, you are typing a shell script that is supposed to look like this:
es_es: Cuando use 'autoindent' o 'smartindent' para obtener el sangrado de línea anterior, habrá ocasiones en que necesite añadir o eliminar un 'shiftwidth' de sangrado. La forma rápida de hacerlo es usando las órdenes «CTRL-D» y «CTRL-T» en modo Insertar. Por ejemplo, está escribiendo un script de consola con el siguiente aspecto:

source: Now you see that you need an extra indent. Type CTRL-T. The result:
es_es: Ahora ve que necesita un sangrado adicional. Pulse«CTRL-T». El resultado:

source: The CTRL-T command, in Insert mode, adds one 'shiftwidth' to the indent, no matter where in the line you are. You continue typing the second line, <Enter> and the third line. This time the indent is OK. Then <Enter> and the last line. Now you have this:
es_es: La orden «CTRL-T», en modo Insertar, añade un 'shiftwidth' al sangrado sin importar en que línea está. Continua escribiendo en la segunda línea, <Intro>, y la tercera línea. Esta vez el sangrado es correcto. Pulse <Intro> y salte a la última línea. Ahora tiene lo siguiente:

source: To remove the superfluous indent in the last line press CTRL-D. This deletes one 'shiftwidth' worth of indent, no matter where you are in the line. When you are in Normal mode, you can use the ">>" and "<<" commands to shift lines. ">" and "<" are operators, thus you have the usual three ways to specify the lines you want to indent. A useful combination is: >
es_es: Para eliminar el sangrado innecesario en la última línea pulse «CTRL-D». Elimina un 'shiftwidth' de sangrado, sin importar dónde está dentro de la línea. Cuando está en modo Normal, puede usar las órdenes «>>» y «<<» para cambiar las líneas. «>» y «<» son operadores, y por ello tiene las tres formas habituales de definir las líneas que desea sangrar. Una combinación útil es la siguiente: >

source: original text after ">i{" after ">a{"
es_es: texto original después de «>i{» después de «>a{»

source: if (flag) if (flag) if (flag) ~ { { { ~ printf("yes"); printf("yes"); printf("yes"); ~ flag = 0; flag = 0; flag = 0; ~ } } } ~
es_es: if (opción) if (opción) if (opción) ~ { { { ~ printf("yes"); printf("yes"); printf("yes"); ~ opción = 0; opción = 0; opción = 0; ~ } } } ~

source: *30.5* Tabs and spaces
es_es: *30.5* Tabulados y espacios

source: 1. Use a mix of <Tab> and space characters. Since a <Tab> takes the place of eight spaces, you have fewer characters in your file. Inserting a <Tab> is quicker than eight spaces. Backspacing works faster as well.
es_es: 1. Use una mezcla de <Tab> y caracteres de espacio. Ya que <Tab> toma el el lugar de 8 espacios, tendrá menos caracteres en su archivo. Insertar un <Tab> es más rápido que 8 espacios. La tecla de retroceso también es más rápido.

source: 2. Use spaces only. This avoids the trouble with programs that use a different tabstop value.
es_es: 2. Utilice espacios solamente. Esto evita los problemas con los programas que utilizan un valor de «tabstop» diferente.

source: If you are using a combination of tabs and spaces, you just edit normally. The Vim defaults do a fine job of handling things. You can make life a little easier by setting the 'softtabstop' option. This option tells Vim to make the <Tab> key look and feel as if tabs were set at the value of 'softtabstop', but actually use a combination of tabs and spaces. After you execute the following command, every time you press the <Tab> key the cursor moves to the next 4-column boundary: >
es_es: Si usa una combinación de tabulados y espacios, puede editar con normalidad. El comportamiento predeterminado de Vim realiza un trabajo inteligente. Puede facilitar su vida definiendo la opción 'softtabstop'. Esta opción le dice a Vim que la tecla <Tab> tenga el comportamiento como si los tabulados estuviesen definidos como un valor 'softtabstop', aunque use en realidad una combinación de tabulados y espacios. Después de ejecutar la siguiente, orden, cada vez que pulse la tecla <Tab> el cursor se moverá al siguiente límite de cuatro columnas: >

source: When you start in the first column and press <Tab>, you get 4 spaces inserted in your text. The second time, Vim takes out the 4 spaces and puts in a <Tab> (thus taking you to column 8). Thus Vim uses as many <Tab>s as possible, and then fills up with spaces. When backspacing it works the other way around. A <BS> will always delete the amount specified with 'softtabstop'. Then <Tab>s are used as many as possible and spaces to fill the gap. The following shows what happens pressing <Tab> a few times, and then using <BS>. A "." stands for a space and "------->" for a <Tab>.
es_es: Cuando empiece en la primera columna y pulse <Tab> obtendrá la inserción de cuatro espacios en su texto. La segunda vez, Vim eliminará los cuatro espacios e insertará un <Tab> (llevándole a la columna 8). Entonces, Vim usa tantos <Tab> como sea posible, rellenándolos con espacios. Al usar la tecla de retroceso, funcionará al revés. Un <Bs> (tecla de retroceso) siempre elimina la cantidad definida con 'softtabstop'. Entonces, se usarán tantos <Tab> como sea posible, rellenando el hueco resultante con espacios. Lo siguiente muestra lo que ocurre cuando pulsa <Tab> varias veces, y después usando <Bs>. Un «.» simboliza un espacio, y «------->» un <Tab>.

source: type result ~ <Tab> .... <Tab><Tab> -------> <Tab><Tab><Tab> ------->.... <Tab><Tab><Tab><BS> -------> <Tab><Tab><Tab><BS><BS> ....
es_es: tipo resultado ~ <Tab> .... <Tab><Tab> -------> <Tab><Tab><Tab> ------->.... <Tab><Tab><Tab><BS> -------> <Tab><Tab><Tab><BS><BS> ....

source: An alternative is to use the 'smarttab' option. When it's set, Vim uses 'shiftwidth' for a <Tab> typed in the indent of a line, and a real <Tab> when typed after the first non-blank character. However, <BS> doesn't work like with 'softtabstop'.
es_es: Una alternativa es usar la opción 'smartab'. Si se define, Vim usa 'shiftwidth' para un <Tab> introducida en el sangrado de una línea, y un <Tab> real cuando se introduce en el primer carácter no vacío. Sin embargo <BS> no funciona de la misma forma que con 'softtabstop'.

source: When this option is set, the <Tab> key inserts a series of spaces. Thus you get the same amount of white space as if a <Tab> character was inserted, but there isn't a real <Tab> character in your file. The backspace key will delete each space by itself. Thus after typing one <Tab> you have to press the <BS> key up to eight times to undo it. If you are in the indent, pressing CTRL-D will be a lot quicker.
es_es: Cuando se define esta opción, la tecla <Tab> inserte una serie de espacios. Por ello, obtiene el mismo espacio en blanco que un carácter <Tab> inserta, aunque en realidad no hay ningún carácter <Tab> en su archivo. La tecla de retroceso eliminará cada espacio por sí mismo. Por ello, después de teclear un <Tab>, tendrá que pulsar la tecla <BS> (retroceso) hasta ocho veces para deshacerlo. Si está dentro de la sangría, pulsar «CTRL-D» es mucho más rápido.

source: Setting 'expandtab' does not affect any existing tabs. In other words, any tabs in the document remain tabs. If you want to convert tabs to spaces, use the ":retab" command. Use these commands: >
es_es: Definir 'expandtab' no afecta a las tabulaciones existentes. En otras palabras, todas las tabulaciones del documento siguen siéndolo. Si desea convertir esas tabulaciones en espacios, use la orden «:retab». Use las siguientes órdenes: >

source: Now Vim will have changed all indents to use spaces instead of tabs. However, all tabs that come after a non-blank character are kept. If you want these to be converted as well, add a !: >
es_es: Ahora, Vim ha cambiado todas las sangrías para que usen espacios en lugar de tabulados. Sin embargo, se respetan todos los tabulados a continuación de un carácter no vacío. Añada «!» si desea convertir éstos también: >

source: This is a little bit dangerous, because it can also change tabs inside a string. To check if these exist, you could use this: >
es_es: Esto es algo peligroso, ya que también puede cambiar los tabulados dentro de una cadena. Puede usar lo siguiente para comprobar la existencia de éstos: >

source: It's recommended not to use hard tabs inside a string. Replace them with "\t" to avoid trouble.
es_es: Se recomienda no usar tabulados rígidos dentro de una cadena. Reemplácelos con «\t» para evitar problemas.

source: *30.6* Formatting comments
es_es: *30.6* Formatear comentarios

source: One of the great things about Vim is that it understands comments. You can ask Vim to format a comment and it will do the right thing. Suppose, for example, that you have the following comment:
es_es: Una de las mayores virtudes de Vim es que entiende comentarios. Puede pedir a Vim que dé formato a un comentario, y hará lo correcto. Suponga que tiene el siguiente comentario:

source: /* ~ * This is a test ~ * of the text formatting. ~ */ ~
es_es: /* ~ * Esta es una prueba ~ * de formateo de texto. ~ */ ~

source: "gq" is the operator to format text. "]/" is the motion that takes you to the end of a comment. The result is:
es_es: «gq» es el operador para formatear texto. «]/» es el movimiento que le lleva al final del comentario. El resultado es:

source: /* ~ * This is a test of the text formatting. ~ */ ~
es_es: /* ~ * Esta es una prueba de formateo de texto. ~ */ ~

source: Notice that Vim properly handled the beginning of each line. An alternative is to select the text that is to be formatted in Visual mode and type "gq".
es_es: Observe que Vim manipuló adecuadamente el principio de cada línea. Una alternativa es seleccionar el texto a formatear en modo Visual, y teclear «gq».
